# Compare DataFrames 01

In [1]:
import pandas as pd

In [20]:
data1 = {
    'fruit' : ['Apple', 'Mango', 'Grapes', 'Pineapple'],
    'quantity' : [10, 10 , 10, 10],
    'price' : [200, 100, 250, 600],
    'Month' : ['Jan', 'Jan', 'Jan', 'Jan']
}

data2 = {
    'fruit' : ['Apple', 'Mango', 'Grapes', 'Pineapple'],
    'quantity' : [10, 10 , 10, 10],
    'price' : [200, 200, 250, 650],
    'Month' : ['Feb', 'Feb', 'Feb', 'Feb']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

#### Comparison of two datasets by row

In [21]:
data_comp = df1.compare(df2, align_axis=0)
data_comp

         price Month
0 self     NaN   Jan
  other    NaN   Feb
1 self   100.0   Jan
  other  200.0   Feb
2 self     NaN   Jan
  other    NaN   Feb
3 self   600.0   Jan
  other  650.0   Feb

#### Comparison of two datasets by columns

In [39]:
data_comp = df1.compare(df2, align_axis=1)
data_comp

   price        Month
    self  other  self other
0    NaN    NaN   Jan   Feb
1  100.0  200.0   Jan   Feb
2    NaN    NaN   Jan   Feb
3  600.0  650.0   Jan   Feb

#### To find equal values of int or float

In [37]:
data_comp = df1.compare(df2, keep_equal=False)
data_comp

   price        Month
    self  other  self other
0    NaN    NaN   Jan   Feb
1  100.0  200.0   Jan   Feb
2    NaN    NaN   Jan   Feb
3  600.0  650.0   Jan   Feb

#### To find equal values in all data.

In [34]:
data_comp = df1.compare(df2, keep_shape=True)
data_comp

  fruit       quantity        price        Month
   self other     self other   self  other  self other
0   NaN   NaN      NaN   NaN    NaN    NaN   Jan   Feb
1   NaN   NaN      NaN   NaN  100.0  200.0   Jan   Feb
2   NaN   NaN      NaN   NaN    NaN    NaN   Jan   Feb
3   NaN   NaN      NaN   NaN  600.0  650.0   Jan   Feb